# Ex - GroupBy

### Introduction:

GroupBy can be summarizes as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [0]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [0]:
drinks=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv")

In [3]:
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

### Step 4. Which continent drinks more beer on average?

In [29]:
drinks.groupby('continent')['beer_servings'].mean().sort_values(ascending=False)

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

In [30]:
drinks.groupby('continent')['beer_servings'].mean().sort_values(ascending=False).index[0]

'EU'

### Step 5. For each continent print the statistics for wine consumption.

In [34]:
drinks.groupby('continent')['wine_servings'].agg(['mean','sum','count'])

                 mean   sum  count
continent
AF          16.264151   862     53
AS           9.068182   399     44
EU         142.222222  6400     45
OC          35.625000   570     16
SA          62.416667   749     12

### Step 6. Print the mean alcohol consumption per continent for every column

In [37]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].agg(['mean'])

               mean
continent
AF         3.007547
AS         2.170455
EU         8.617778
OC         3.381250
SA         6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [39]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].agg(['median'])

           median
continent
AF           2.30
AS           1.20
EU          10.00
OC           1.75
SA           6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [40]:
drinks.groupby('continent')['spirit_servings'].agg(['mean','min','max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302